app/controllers/api/conversations_controller.rb

  def index
    render json: Conversation.all, status: 200
---
SELECT "conversations".* FROM "conversations"

  def create
    #Arreglar los casos bordes y casos donde la conversacion ya esta creada!
    conversation = Conversation.create()
---
INSERT INTO "user_conversations" ("created_at", "updated_at", "user_id", "conversation_id") VALUES (?, ?, ?, ?)  [["created_at", "2017-09-02 21:10:01.379666"], ["updated_at", "2017-09-02 21:10:01.379666"], ["user_id", 2], ["conversation_id", 2]]