app/controllers/api/messages_controller.rb

  def index
    render json: Message.all, status: 200
---
SELECT  "messages".* FROM "messages" ORDER BY "messages"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def create
    if Conversation.find(params[:message][:conversation_id])
      message = Message.new(message_params)
      if message.save
---
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("info", "created_at", "updated_at", "conversation_id", "user_id") VALUES (?, ?, ?, ?, ?)  [["info", "hola viejazo!"], ["created_at", "2017-09-02 19:55:41.878707"], ["updated_at", "2017-09-02 19:55:41.878707"], ["conversation_id", 1], ["user_id", 2]]

  def show
    if message = Message.where(id: @id).first
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? ORDER BY "messages"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    # First make sure all params are there if it's a PUT
        if request.put? && !Message.validate_params(message_params)
            return render json: { message: 'Faltan datos para el mensaje', params: message_params, expected_params: Message.required_params }, status: 400
        end
        if message = Message.where(id: @id).first
            # We have a product with this uuid
            if message.update(message_params)
                render json: { message: message }, status: 200
            else
                render json: { message: 'Falló actualización', params: message_params }, status: 500
            end
        else
            # Let's create a new message only if PUT
            unless request.put?
                return render json: { message: 'Mensaje no existe' }, status: 404
            end
            p "antes del new"
            message = Message.new(message_params)
            if message.save
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? ORDER BY "messages"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "messages" SET "info" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["info", "segunda prueba api"], ["updated_at", "2017-09-02 14:54:27.242401"], ["id", 2]]
INSERT INTO "messages" ("info", "created_at", "updated_at", "conversation_id", "user_id") VALUES (?, ?, ?, ?, ?)  [["info", "hola washo"], ["created_at", "2017-09-02 19:50:42.032628"], ["updated_at", "2017-09-02 19:50:42.032628"], ["conversation_id", 1], ["user_id", 1]]