app/controllers/api/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    render json: User.all, status: 200

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "user_conversations".* FROM "user_conversations" WHERE "user_conversations"."user_id" = ?  [["user_id", 1]]
---
  def show
    if user = User.where(id: @id).first
      conversations = []
      user.user_conversations.each do |p|

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "users" ("name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Juan"], ["password", "arcoiris"], ["created_at", "2017-09-02 15:08:08.936483"], ["updated_at", "2017-09-02 15:08:08.936483"]]
---
  def update
    # First make sure all params are there if it's a PUT
        if request.put? && !User.validate_params(user_params)
            return render json: { user: 'Faltan datos para el mensaje', params: user_params, expected_params: User.required_params }, status: 400
        end
        if user = User.where(id: @id).first
            # We have a product with this uuid
            if user.update(user_params)
                render json: { user: user }, status: 200
            else
                render json: { user: 'Falló actualización', params: user_params }, status: 500
            end
        else
            # Let's create a new user only if PUT
            unless request.put?
                return render json: { user: 'Mensaje no existe' }, status: 404
            end
            p "antes del new"
            user = User.new(name: params[:user][:name], password: params[:user][:password])
            if user.save